; domain
(define (domain ricochet-robots)
(:requirements :typing :adl :action-costs)

(:types
    robot - object
    cell - object
    direction - object
)

(:predicates
    ;; ?cnext is right next to ?c in the direction of ?dir
    (NEXT ?dummy - cell ?c - cell ?cnext - cell ?dir - direction)
    ;; moving from ?c in the direction ?dir is blocked
    (BLOCKED ?dummy - cell ?c - cell ?dir - direction)
    ;; Robot ?r is located in the cell ?c
    (at ?dummy - robot ?r - robot ?c - cell)
    ;; No robot is located in the cell ?c
    (free ?dummy - cell ?c - cell)
    ;; No robot is moving anywhere
    (nothing-is-moving)
    ;; Robot ?r is moving in the direction ?dir
    (is-moving ?dummy - robot ?r - robot ?dir - direction)
)

(:functions
    (total-cost) - number

    ;; The costs of actions are configurable.
    ;; If we want to count only the number of movements of robots instead of
    ;; counting all steps from a cell to cell (as it would be in the real
    ;; game), then we need to set
    ;;      (= (go-cost) 1)
    ;;      (= (step-cost) 0)
    ;;      (= (stop-cost) 0)
    (go-cost) - number
    (step-cost) - number
    (stop-cost) - number
)

;; Starts movement of the robot ?r in the direction ?dir
(:action go
    :parameters (?r - robot ?dir - direction)
    :precondition
        (and
            (nothing-is-moving)

            ;; If we want to make sure that the robot can actually make a step
            ;; in the specified direction, then we need to add the following
            ;; (and the corresponding parameters ?cfrom and ?cto):
            ;;
            ;; (at ?r ?cfrom)
            ;; (NEXT ?cfrom ?cto ?dir)
            ;; (free ?cto)
            ;; (not (BLOCKED ?cfrom ?dir))
        )
    :effect
        (and
            (not (nothing-is-moving))
            (is-moving ?r ?r ?dir)
            (increase (total-cost) (go-cost))
        )
)

;; Make one step from the cell ?cfrom to the cell ?cto with the robot ?r
;; Robot is allowed to make the step only if it is the (only) one currently
;; moving, and it is moving in the direction ?dir
(:action step
    :parameters (?r - robot ?cfrom - cell ?cto - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?r ?dir)
            (at ?r ?r ?cfrom)
            (NEXT ?cfrom ?cfrom ?cto ?dir)
            (free ?cto ?cto)
            (not (BLOCKED ?cfrom ?cfrom ?dir))
        )
    :effect
        (and
            (not (at ?r ?r ?cfrom))
            (free ?cfrom ?cfrom)
            (not (free ?cto ?cto))
            (at ?r ?r ?cto)
            (increase (total-cost) (step-cost))
        )
)

;; Stopping of the robot is split between
;; (i) stop-at-barrier which stops the robot if it cannot move further due to
;;     a barrier expressed with (BLOCKED ...) predicate
;; (ii) stop-at-robot which stops the robot if the next step is blocked by
;;      another robot
(:action stop-at-barrier
    :parameters (?r - robot ?cat - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?r ?dir)
            (at ?r ?r ?cat)
            (BLOCKED ?cat ?cat ?dir)
        )
    :effect
        (and
            (not (is-moving ?r ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)

(:action stop-at-robot
    :parameters (?r - robot ?cat - cell ?cnext - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?r ?dir)
            (at ?r ?r ?cat)
            (NEXT ?cat ?cat ?cnext ?dir)
            (not (free ?cnext ?cnext))
        )
    :effect
        (and
            (not (is-moving ?r ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)
)

; problem
;; Generated from file generate-9582.asp from the ASP competition 2015
;;
;; +xx+xx+xx+xx+xx+xx+
;; x  |  |R1|R4|  xG3x
;; +xx+--+--+--+--+--+
;; x  |  x  |  |  |  x
;; +--+--+--+--+--+--+
;; x  |  |  x  |  |  x
;; +--+xx+--+--+xx+--+
;; x  |  |  x  |  |  x
;; +--+xx+--+--+xx+--+
;; x  |R3|R2|  |  |  x
;; +--+--+--+xx+--+--+
;; x  x  x  |  |  |  x
;; +xx+xx+xx+xx+xx+xx+

(define (problem ricochet-robots-6x6-None-233178)
(:domain ricochet-robots)

(:objects
    cell-1-1 cell-1-2 cell-1-3 cell-1-4 cell-1-5 cell-1-6 cell-2-1 cell-2-2 cell-2-3 cell-2-4 cell-2-5 cell-2-6 cell-3-1 cell-3-2 cell-3-3 cell-3-4 cell-3-5 cell-3-6 cell-4-1 cell-4-2 cell-4-3 cell-4-4 cell-4-5 cell-4-6 cell-5-1 cell-5-2 cell-5-3 cell-5-4 cell-5-5 cell-5-6 cell-6-1 cell-6-2 cell-6-3 cell-6-4 cell-6-5 cell-6-6 - cell
    robot-1 robot-2 robot-3 robot-4 - robot
    west east north south - direction
)

(:init
    (NEXT cell-1-1 cell-1-1 cell-1-2 south)
    (NEXT cell-1-2 cell-1-2 cell-1-3 south)
    (NEXT cell-1-3 cell-1-3 cell-1-4 south)
    (NEXT cell-1-4 cell-1-4 cell-1-5 south)
    (NEXT cell-1-5 cell-1-5 cell-1-6 south)
    (NEXT cell-2-1 cell-2-1 cell-2-2 south)
    (NEXT cell-2-2 cell-2-2 cell-2-3 south)
    (NEXT cell-2-3 cell-2-3 cell-2-4 south)
    (NEXT cell-2-4 cell-2-4 cell-2-5 south)
    (NEXT cell-2-5 cell-2-5 cell-2-6 south)
    (NEXT cell-3-1 cell-3-1 cell-3-2 south)
    (NEXT cell-3-2 cell-3-2 cell-3-3 south)
    (NEXT cell-3-3 cell-3-3 cell-3-4 south)
    (NEXT cell-3-4 cell-3-4 cell-3-5 south)
    (NEXT cell-3-5 cell-3-5 cell-3-6 south)
    (NEXT cell-4-1 cell-4-1 cell-4-2 south)
    (NEXT cell-4-2 cell-4-2 cell-4-3 south)
    (NEXT cell-4-3 cell-4-3 cell-4-4 south)
    (NEXT cell-4-4 cell-4-4 cell-4-5 south)
    (NEXT cell-4-5 cell-4-5 cell-4-6 south)
    (NEXT cell-5-1 cell-5-1 cell-5-2 south)
    (NEXT cell-5-2 cell-5-2 cell-5-3 south)
    (NEXT cell-5-3 cell-5-3 cell-5-4 south)
    (NEXT cell-5-4 cell-5-4 cell-5-5 south)
    (NEXT cell-5-5 cell-5-5 cell-5-6 south)
    (NEXT cell-6-1 cell-6-1 cell-6-2 south)
    (NEXT cell-6-2 cell-6-2 cell-6-3 south)
    (NEXT cell-6-3 cell-6-3 cell-6-4 south)
    (NEXT cell-6-4 cell-6-4 cell-6-5 south)
    (NEXT cell-6-5 cell-6-5 cell-6-6 south)
    (NEXT cell-1-6 cell-1-6 cell-1-5 north)
    (NEXT cell-1-5 cell-1-5 cell-1-4 north)
    (NEXT cell-1-4 cell-1-4 cell-1-3 north)
    (NEXT cell-1-3 cell-1-3 cell-1-2 north)
    (NEXT cell-1-2 cell-1-2 cell-1-1 north)
    (NEXT cell-2-6 cell-2-6 cell-2-5 north)
    (NEXT cell-2-5 cell-2-5 cell-2-4 north)
    (NEXT cell-2-4 cell-2-4 cell-2-3 north)
    (NEXT cell-2-3 cell-2-3 cell-2-2 north)
    (NEXT cell-2-2 cell-2-2 cell-2-1 north)
    (NEXT cell-3-6 cell-3-6 cell-3-5 north)
    (NEXT cell-3-5 cell-3-5 cell-3-4 north)
    (NEXT cell-3-4 cell-3-4 cell-3-3 north)
    (NEXT cell-3-3 cell-3-3 cell-3-2 north)
    (NEXT cell-3-2 cell-3-2 cell-3-1 north)
    (NEXT cell-4-6 cell-4-6 cell-4-5 north)
    (NEXT cell-4-5 cell-4-5 cell-4-4 north)
    (NEXT cell-4-4 cell-4-4 cell-4-3 north)
    (NEXT cell-4-3 cell-4-3 cell-4-2 north)
    (NEXT cell-4-2 cell-4-2 cell-4-1 north)
    (NEXT cell-5-6 cell-5-6 cell-5-5 north)
    (NEXT cell-5-5 cell-5-5 cell-5-4 north)
    (NEXT cell-5-4 cell-5-4 cell-5-3 north)
    (NEXT cell-5-3 cell-5-3 cell-5-2 north)
    (NEXT cell-5-2 cell-5-2 cell-5-1 north)
    (NEXT cell-6-6 cell-6-6 cell-6-5 north)
    (NEXT cell-6-5 cell-6-5 cell-6-4 north)
    (NEXT cell-6-4 cell-6-4 cell-6-3 north)
    (NEXT cell-6-3 cell-6-3 cell-6-2 north)
    (NEXT cell-6-2 cell-6-2 cell-6-1 north)
    (NEXT cell-1-1 cell-1-1 cell-2-1 east)
    (NEXT cell-2-1 cell-2-1 cell-3-1 east)
    (NEXT cell-3-1 cell-3-1 cell-4-1 east)
    (NEXT cell-4-1 cell-4-1 cell-5-1 east)
    (NEXT cell-5-1 cell-5-1 cell-6-1 east)
    (NEXT cell-1-2 cell-1-2 cell-2-2 east)
    (NEXT cell-2-2 cell-2-2 cell-3-2 east)
    (NEXT cell-3-2 cell-3-2 cell-4-2 east)
    (NEXT cell-4-2 cell-4-2 cell-5-2 east)
    (NEXT cell-5-2 cell-5-2 cell-6-2 east)
    (NEXT cell-1-3 cell-1-3 cell-2-3 east)
    (NEXT cell-2-3 cell-2-3 cell-3-3 east)
    (NEXT cell-3-3 cell-3-3 cell-4-3 east)
    (NEXT cell-4-3 cell-4-3 cell-5-3 east)
    (NEXT cell-5-3 cell-5-3 cell-6-3 east)
    (NEXT cell-1-4 cell-1-4 cell-2-4 east)
    (NEXT cell-2-4 cell-2-4 cell-3-4 east)
    (NEXT cell-3-4 cell-3-4 cell-4-4 east)
    (NEXT cell-4-4 cell-4-4 cell-5-4 east)
    (NEXT cell-5-4 cell-5-4 cell-6-4 east)
    (NEXT cell-1-5 cell-1-5 cell-2-5 east)
    (NEXT cell-2-5 cell-2-5 cell-3-5 east)
    (NEXT cell-3-5 cell-3-5 cell-4-5 east)
    (NEXT cell-4-5 cell-4-5 cell-5-5 east)
    (NEXT cell-5-5 cell-5-5 cell-6-5 east)
    (NEXT cell-1-6 cell-1-6 cell-2-6 east)
    (NEXT cell-2-6 cell-2-6 cell-3-6 east)
    (NEXT cell-3-6 cell-3-6 cell-4-6 east)
    (NEXT cell-4-6 cell-4-6 cell-5-6 east)
    (NEXT cell-5-6 cell-5-6 cell-6-6 east)
    (NEXT cell-6-1 cell-6-1 cell-5-1 west)
    (NEXT cell-5-1 cell-5-1 cell-4-1 west)
    (NEXT cell-4-1 cell-4-1 cell-3-1 west)
    (NEXT cell-3-1 cell-3-1 cell-2-1 west)
    (NEXT cell-2-1 cell-2-1 cell-1-1 west)
    (NEXT cell-6-2 cell-6-2 cell-5-2 west)
    (NEXT cell-5-2 cell-5-2 cell-4-2 west)
    (NEXT cell-4-2 cell-4-2 cell-3-2 west)
    (NEXT cell-3-2 cell-3-2 cell-2-2 west)
    (NEXT cell-2-2 cell-2-2 cell-1-2 west)
    (NEXT cell-6-3 cell-6-3 cell-5-3 west)
    (NEXT cell-5-3 cell-5-3 cell-4-3 west)
    (NEXT cell-4-3 cell-4-3 cell-3-3 west)
    (NEXT cell-3-3 cell-3-3 cell-2-3 west)
    (NEXT cell-2-3 cell-2-3 cell-1-3 west)
    (NEXT cell-6-4 cell-6-4 cell-5-4 west)
    (NEXT cell-5-4 cell-5-4 cell-4-4 west)
    (NEXT cell-4-4 cell-4-4 cell-3-4 west)
    (NEXT cell-3-4 cell-3-4 cell-2-4 west)
    (NEXT cell-2-4 cell-2-4 cell-1-4 west)
    (NEXT cell-6-5 cell-6-5 cell-5-5 west)
    (NEXT cell-5-5 cell-5-5 cell-4-5 west)
    (NEXT cell-4-5 cell-4-5 cell-3-5 west)
    (NEXT cell-3-5 cell-3-5 cell-2-5 west)
    (NEXT cell-2-5 cell-2-5 cell-1-5 west)
    (NEXT cell-6-6 cell-6-6 cell-5-6 west)
    (NEXT cell-5-6 cell-5-6 cell-4-6 west)
    (NEXT cell-4-6 cell-4-6 cell-3-6 west)
    (NEXT cell-3-6 cell-3-6 cell-2-6 west)
    (NEXT cell-2-6 cell-2-6 cell-1-6 west)

    (BLOCKED cell-1-1 cell-1-1 north)
    (BLOCKED cell-1-6 cell-1-6 south)
    (BLOCKED cell-1-6 cell-1-6 north)
    (BLOCKED cell-2-6 cell-2-6 south)
    (BLOCKED cell-3-1 cell-3-1 north)
    (BLOCKED cell-3-6 cell-3-6 south)
    (BLOCKED cell-4-1 cell-4-1 north)
    (BLOCKED cell-4-6 cell-4-6 south)
    (BLOCKED cell-5-1 cell-5-1 north)
    (BLOCKED cell-5-6 cell-5-6 south)
    (BLOCKED cell-6-1 cell-6-1 north)
    (BLOCKED cell-6-6 cell-6-6 south)
    (BLOCKED cell-1-1 cell-1-1 west)
    (BLOCKED cell-6-1 cell-6-1 east)
    (BLOCKED cell-1-2 cell-1-2 west)
    (BLOCKED cell-6-2 cell-6-2 east)
    (BLOCKED cell-1-3 cell-1-3 west)
    (BLOCKED cell-6-3 cell-6-3 east)
    (BLOCKED cell-1-4 cell-1-4 west)
    (BLOCKED cell-6-4 cell-6-4 east)
    (BLOCKED cell-1-5 cell-1-5 west)
    (BLOCKED cell-6-5 cell-6-5 east)
    (BLOCKED cell-1-6 cell-1-6 west)
    (BLOCKED cell-6-6 cell-6-6 east)
    (BLOCKED cell-2-6 cell-2-6 west)
    (BLOCKED cell-1-6 cell-1-6 east)
    (BLOCKED cell-4-4 cell-4-4 west)
    (BLOCKED cell-3-4 cell-3-4 east)
    (BLOCKED cell-2-5 cell-2-5 north)
    (BLOCKED cell-2-4 cell-2-4 south)
    (BLOCKED cell-4-3 cell-4-3 west)
    (BLOCKED cell-3-3 cell-3-3 east)
    (BLOCKED cell-2-3 cell-2-3 south)
    (BLOCKED cell-2-4 cell-2-4 north)
    (BLOCKED cell-6-1 cell-6-1 west)
    (BLOCKED cell-5-1 cell-5-1 east)
    (BLOCKED cell-4-5 cell-4-5 south)
    (BLOCKED cell-4-6 cell-4-6 north)
    (BLOCKED cell-5-3 cell-5-3 south)
    (BLOCKED cell-5-4 cell-5-4 north)
    (BLOCKED cell-5-5 cell-5-5 north)
    (BLOCKED cell-5-4 cell-5-4 south)
    (BLOCKED cell-3-2 cell-3-2 west)
    (BLOCKED cell-2-2 cell-2-2 east)
    (BLOCKED cell-1-2 cell-1-2 north)
    (BLOCKED cell-1-1 cell-1-1 south)
    (BLOCKED cell-3-6 cell-3-6 west)
    (BLOCKED cell-2-6 cell-2-6 east)

    (free cell-1-1 cell-1-1)
    (free cell-1-2 cell-1-2)
    (free cell-1-3 cell-1-3)
    (free cell-1-4 cell-1-4)
    (free cell-1-5 cell-1-5)
    (free cell-1-6 cell-1-6)
    (free cell-2-1 cell-2-1)
    (free cell-2-2 cell-2-2)
    (free cell-2-3 cell-2-3)
    (free cell-2-4 cell-2-4)
    (free cell-2-6 cell-2-6)
    (free cell-3-2 cell-3-2)
    (free cell-3-3 cell-3-3)
    (free cell-3-4 cell-3-4)
    (free cell-3-6 cell-3-6)
    (free cell-4-2 cell-4-2)
    (free cell-4-3 cell-4-3)
    (free cell-4-4 cell-4-4)
    (free cell-4-5 cell-4-5)
    (free cell-4-6 cell-4-6)
    (free cell-5-1 cell-5-1)
    (free cell-5-2 cell-5-2)
    (free cell-5-3 cell-5-3)
    (free cell-5-4 cell-5-4)
    (free cell-5-5 cell-5-5)
    (free cell-5-6 cell-5-6)
    (free cell-6-1 cell-6-1)
    (free cell-6-2 cell-6-2)
    (free cell-6-3 cell-6-3)
    (free cell-6-4 cell-6-4)
    (free cell-6-5 cell-6-5)
    (free cell-6-6 cell-6-6)

    (at robot-1 robot-1 cell-3-1) ;; red
    (at robot-2 robot-2 cell-3-5) ;; blue
    (at robot-3 robot-3 cell-2-5) ;; green
    (at robot-4 robot-4 cell-4-1) ;; yellow

    (nothing-is-moving)

    (= (total-cost) 0)
    (= (go-cost) 1)
    (= (step-cost) 0)
    (= (stop-cost) 0)
)
(:goal
    (and
        (at robot-3 robot-3 cell-6-1)
        (nothing-is-moving)
    )
)
(:metric minimize (total-cost))
)

; plan
1. (go robot-3 west)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 robot-3 west)
   goals met: 0 of 2
2. (step robot-3 cell-2-5 cell-1-5 west)
   deleted: (at robot-3 robot-3 cell-2-5) (free cell-1-5 cell-1-5)
   added: (free cell-2-5 cell-2-5) (at robot-3 robot-3 cell-1-5)
   goals met: 0 of 2
3. (stop-at-barrier robot-3 cell-1-5 west)
   deleted: (is-moving robot-3 robot-3 west)
   added: (nothing-is-moving)
   goals met: 1 of 2
4. (go robot-2 west)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 robot-2 west)
   goals met: 0 of 2
5. (step robot-2 cell-3-5 cell-2-5 west)
   deleted: (at robot-2 robot-2 cell-3-5) (free cell-2-5 cell-2-5)
   added: (free cell-3-5 cell-3-5) (at robot-2 robot-2 cell-2-5)
   goals met: 0 of 2
6. (stop-at-robot robot-2 cell-2-5 cell-1-5 west)
   deleted: (is-moving robot-2 robot-2 west)
   added: (nothing-is-moving)
   goals met: 1 of 2
7. (go robot-2 south)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 robot-2 south)
   goals met: 0 of 2
8. (step robot-2 cell-2-5 cell-2-6 south)
   deleted: (at robot-2 robot-2 cell-2-5) (free cell-2-6 cell-2-6)
   added: (free cell-2-5 cell-2-5) (at robot-2 robot-2 cell-2-6)
   goals met: 0 of 2
9. (stop-at-barrier robot-2 cell-2-6 south)
   deleted: (is-moving robot-2 robot-2 south)
   added: (nothing-is-moving)
   goals met: 1 of 2
10. (go robot-3 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 robot-3 east)
   goals met: 0 of 2
11. (step robot-3 cell-1-5 cell-2-5 east)
   deleted: (at robot-3 robot-3 cell-1-5) (free cell-2-5 cell-2-5)
   added: (free cell-1-5 cell-1-5) (at robot-3 robot-3 cell-2-5)
   goals met: 0 of 2
12. (step robot-3 cell-2-5 cell-3-5 east)
   deleted: (at robot-3 robot-3 cell-2-5) (free cell-3-5 cell-3-5)
   added: (free cell-2-5 cell-2-5) (at robot-3 robot-3 cell-3-5)
   goals met: 0 of 2
13. (step robot-3 cell-3-5 cell-4-5 east)
   deleted: (at robot-3 robot-3 cell-3-5) (free cell-4-5 cell-4-5)
   added: (free cell-3-5 cell-3-5) (at robot-3 robot-3 cell-4-5)
   goals met: 0 of 2
14. (step robot-3 cell-4-5 cell-5-5 east)
   deleted: (at robot-3 robot-3 cell-4-5) (free cell-5-5 cell-5-5)
   added: (free cell-4-5 cell-4-5) (at robot-3 robot-3 cell-5-5)
   goals met: 0 of 2
15. (step robot-3 cell-5-5 cell-6-5 east)
   deleted: (at robot-3 robot-3 cell-5-5) (free cell-6-5 cell-6-5)
   added: (free cell-5-5 cell-5-5) (at robot-3 robot-3 cell-6-5)
   goals met: 0 of 2
16. (stop-at-barrier robot-3 cell-6-5 east)
   deleted: (is-moving robot-3 robot-3 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
17. (go robot-3 north)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 robot-3 north)
   goals met: 0 of 2
18. (step robot-3 cell-6-5 cell-6-4 north)
   deleted: (at robot-3 robot-3 cell-6-5) (free cell-6-4 cell-6-4)
   added: (free cell-6-5 cell-6-5) (at robot-3 robot-3 cell-6-4)
   goals met: 0 of 2
19. (step robot-3 cell-6-4 cell-6-3 north)
   deleted: (at robot-3 robot-3 cell-6-4) (free cell-6-3 cell-6-3)
   added: (free cell-6-4 cell-6-4) (at robot-3 robot-3 cell-6-3)
   goals met: 0 of 2
20. (step robot-3 cell-6-3 cell-6-2 north)
   deleted: (at robot-3 robot-3 cell-6-3) (free cell-6-2 cell-6-2)
   added: (free cell-6-3 cell-6-3) (at robot-3 robot-3 cell-6-2)
   goals met: 0 of 2
21. (step robot-3 cell-6-2 cell-6-1 north)
   deleted: (at robot-3 robot-3 cell-6-2) (free cell-6-1 cell-6-1)
   added: (free cell-6-2 cell-6-2) (at robot-3 robot-3 cell-6-1)
   goals met: 1 of 2
22. (stop-at-barrier robot-3 cell-6-1 north)
   deleted: (is-moving robot-3 robot-3 north)
   added: (nothing-is-moving)
   goals met: 2 of 2
